app/controllers/employees_controller.rb

INSERT INTO "employees" ("admission", "created_at", "lastname", "name", "phone", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["admission", "2014-02-06"], ["created_at", "2014-08-06 06:05:56.803488"], ["lastname", "Caicedo"], ["name", "Andres"], ["phone", "5559966"], ["updated_at", "2014-08-06 06:05:56.803488"]]
---
  def create
    @employee = Employee.new(employee_params)

    respond_to do |format|
      if @employee.save

UPDATE "employees" SET "admission" = ?, "updated_at" = ? WHERE "employees"."id" = 2  [["admission", "2014-06-08"], ["updated_at", "2014-08-07 02:58:37.428880"]]
---
  def update
    respond_to do |format|
      if @employee.update(employee_params)

SELECT  "employees".* FROM "employees"  WHERE "employees"."id" = ? LIMIT 1  [["id", 2]]
---
    def set_employee
      @employee = Employee.find(params[:id])